results/readahead-sweep-glm-20260630/radefault-randrw-r3-fio.txt
storage_test: (g=0): rw=randrw, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 128 processes

storage_test: (groupid=0, jobs=128): err= 0: pid=2859004: Wed Jul  1 13:23:24 2026
  read: IOPS=109, BW=27.5MiB/s (28.8MB/s)(1706MiB/62052msec)
    slat (usec): min=549, max=3629.1k, avg=1139552.93, stdev=895569.17
    clat (usec): min=7, max=61885k, avg=31458816.18, stdev=17494831.47
     lat (msec): min=164, max=62049, avg=32598.37, stdev=17387.98
    clat percentiles (usec):
     |  1.00th=[      10],  5.00th=[ 2600469], 10.00th=[ 6677332],
     | 20.00th=[13488882], 30.00th=[17112761], 40.00th=[17112761],
     | 50.00th=[17112761], 60.00th=[17112761], 70.00th=[17112761],
     | 80.00th=[17112761], 90.00th=[17112761], 95.00th=[17112761],
     | 99.00th=[17112761], 99.50th=[17112761], 99.90th=[17112761],
     | 99.95th=[17112761], 99.99th=[17112761]
  write: IOPS=108, BW=27.2MiB/s (28.5MB/s)(1687MiB/62052msec); 0 zone resets
    slat (usec): min=218, max=4542, avg=567.00, stdev=124.72
    clat (msec): min=1516, max=61979, avg=32435.58, stdev=17468.36
     lat (msec): min=1517, max=61979, avg=32436.15, stdev=17468.35
    clat percentiles (msec):
     |  1.00th=[ 1989],  5.00th=[ 4279], 10.00th=[ 7550], 20.00th=[14429],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
  lat (usec)   : 10=0.74%, 20=0.15%, 50=0.04%
  lat (msec)   : 250=0.04%, 500=0.03%, 750=0.06%, 1000=0.01%, 2000=0.92%
  lat (msec)   : >=2000=98.00%
  cpu          : usr=0.01%, sys=0.01%, ctx=32573, majf=0, minf=1622
  IO depths    : 1=0.9%, 2=1.9%, 4=3.8%, 8=7.5%, 16=15.1%, 32=30.2%, >=64=40.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=0.8%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=99.2%
     issued rwts: total=6824,6749,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=27.5MiB/s (28.8MB/s), 27.5MiB/s-27.5MiB/s (28.8MB/s-28.8MB/s), io=1706MiB (1789MB), run=62052-62052msec
  WRITE: bw=27.2MiB/s (28.5MB/s), 27.2MiB/s-27.2MiB/s (28.5MB/s-28.5MB/s), io=1687MiB (1769MB), run=62052-62052msec